
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВЧат(Команда)
	ОтправитьВЧатНаСервере();
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ОтправитьВЧатНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для каждого ОбъектНазначения Из Параметры.ОбъектыНазначения Цикл
		
		ОбработкаОбъект.ОтправитьСообщение(ОбъектНазначения, ПолучитьТекстСообщения());
		
	КонецЦикла; 		
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТекстСообщения()
	Возврат СокрЛП(ТекстСообщения);	
КонецФункции


#КонецОбласти

