
&НаКлиенте
Процедура Тест(Команда)
	
	//готовим параметры
	СозданныеОбъекты = Новый Массив;
	ОбъектыНазначения = Новый Массив;
	Для каждого ТекЭлементСписка Из МассивОбъектов Цикл
	         ОбъектыНазначения.Добавить(ТекЭлементСписка.Значение);
	КонецЦикла; 
	СозданныеОбъекты = Новый Массив;
	
	//запускаем сам алгоритм
	ЗапуститьИсполнениеНаСервере(ОбъектыНазначения, СозданныеОбъекты);
	
	
	//извещение форм получателей
	ТипыСозданныхОбъектов = Новый Массив;
		
		Для Каждого СозданныйОбъект Из СозданныеОбъекты Цикл
			Тип = ТипЗнч(СозданныйОбъект);
			Если ТипыСозданныхОбъектов.Найти(Тип) = Неопределено Тогда
				ТипыСозданныхОбъектов.Добавить(Тип);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Тип Из ТипыСозданныхОбъектов Цикл
			ОповеститьОбИзменении(Тип);
		КонецЦикла;

	
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьИсполнениеНаСервере(ОбъектыНазначения, СозданныеОбъекты)
	
	
	ОбъектОбр = РеквизитФормыВЗначение("Объект");
	ОбъектОбр.ВыполнитьКоманду("<ИдентификаторКоманды>", ОбъектыНазначения, СозданныеОбъекты, Неопределено);
	
КонецПроцедуры

