
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВЧат(Команда)
	ОтправитьВЧатНаСервере();
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ОтправитьВЧатНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для каждого ОбъектНазначения Из Параметры.ОбъектыНазначения Цикл
		
		Реквизиты 				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектНазначения, "Организация,Контрагент");			
		ИдентификаторПолучателя = ОбработкаОбъект.ПолучитьИдентификаторПолучателя(Реквизиты.Организация);
		МенеджерОбъекта 		= ОбщегоНазначения.МенеджерОбъектаПоСсылке(ОбъектНазначения);
		
		КоллекцияПечатныхФорм 	= УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ОбработкаОбъект.ПолучитьИмяМакетаПоМетаданным(ОбъектНазначения));
		ПараметрыВывода 		= УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
		ОбъектыПечати 			= Новый СписокЗначений;		
		
		МенеджерОбъекта.Печать(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектНазначения), , 
			КоллекцияПечатныхФорм,
			ОбъектыПечати,
			ПараметрыВывода);			
		
		Для каждого ТекПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
			
			имяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
			
			ТекПечатнаяФорма.ТабличныйДокумент.Записать(
			имяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			Успешно = ОбработкаОбъект.ОтправитьФайл(
				ИдентификаторПолучателя,
				Новый ДвоичныеДанные(имяВременногоФайла),
					ОбработкаОбъект.ПолучитьИмяФайла(
						ТекПечатнаяФорма.СинонимМакета, 
						Реквизиты.Контрагент),
						ПолучитьТекстСообщения()); 
			
			Если Успешно Тогда
				Попытка
					УдалитьФайлы(имяВременногоФайла);
				Исключение
					ЗаписьЖурналаРегистрации("Удаление временного файла",
					УровеньЖурналаРегистрации.Предупреждение, , ,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;				
			КонецЕсли;       			
		КонецЦикла; 
		
		
		
		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТекстСообщения()
	Возврат СокрЛП(ТекстСообщения);	
КонецФункции


#КонецОбласти

