#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Тестировать() Экспорт
	
	ПроверитьЗаполненнуюПериодичность();
		
КонецПроцедуры


#КонецОбласти

#Область Проверки

Процедура ПроверитьЗаполненнуюПериодичность()
	
	ШаблонОшибки = "У %1 не заполнено свойство периодичность. Необходимо зайти в свойства документа на вкладку Нумерация и установить свойство периодичность";
	
	ОшибочныеОбъекты = Новый Массив;	
	
	Для каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		
		Если СтрНайти(ВРег(ОбъектМетаданных.Имя),ПрефиксПоиска()) > 0
			И ИсключаемыеДокументы().Найти(ОбъектМетаданных.ПолноеИмя()) = Неопределено
			И ОбъектМетаданных.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Непериодический Тогда
			
			ОшибочныеОбъекты.Добавить(ОбъектМетаданных.ПолноеИмя());
			
		КонецЕсли; 	
		
	КонецЦикла; 
	
	Если ОшибочныеОбъекты.Количество() > 0 Тогда
		
		ОбъектыСтрокой = СтрСоединить(ОшибочныеОбъекты, Символы.ПС);
		
		ВызватьИсключение СтрШаблон( ШаблонОшибки, ОбъектыСтрокой );
		
	КонецЕсли;                                        	
	
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает префикс поиска метаданного, когда разработка ведется по префиксам
// 
// Возвращаемое значение:
//   - 
//
Функция ПрефиксПоиска()
	Возврат ВРег("слм_");
КонецФункции //ПрефиксПоиска

Функция ИсключаемыеДокументы()
	
	ИсключаемыеДокументы = Новый Массив;
	// например, 
	//ИсключаемыеДокументы.Добавить(Метаданные.Документы.слм_ТаймСлот);
	//ИсключаемыеДокументы.Добавить(Метаданные.Документы.слм_КорректировкаПрограмм.ПолноеИмя());
	//ИсключаемыеДокументы.Добавить(Метаданные.Документы.слм_ДополнительнаяСделкаКСПП.ПолноеИмя());	
	
	Возврат Новый ФиксированныйМассив(ИсключаемыеДокументы);	
КонецФункции //ИсключаемыеДокументы

#КонецОбласти
    
#Иначе
 ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли